# 第一章 pandas基础

## Pandas简介
- pandas对数据进行导入、清洗、处理、统计和输出。pandas是基于 Numpy 库的，是为了解决数据分析任务而创建的。


## pandas快速安装
- 常用安装方法
  pip install pandas
- 离线安装  
 （1）可以访问到pypi三方库中搜索pandas的离线包，找到python的对应版本进行下载  
 （2）hirt+鼠标右键-》 Power shell 窗口 执行：pip install pandas-1.0.3-cp36-cp36m-win_amd64.whl 进行安装

In [7]:
import pandas as pd
import numpy as np
pd.__version__

'1.0.3'

## 一、csv、txt、xls或xlsx文件读取与写入
#### 1.读取与写入csv格式
#### a.csv格式

In [10]:
df = pd.read_csv('joyful-pandas-master/data/table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

#### b.txt格式

In [11]:
df_txt = pd.read_table('joyful-pandas-master/data/table.txt') 
df_txt

   col1 col2  col3    col4
0     2    a   1.4   apple
1     3    b   3.4  banana
2     6    c   2.5  orange
3     5    d   3.2   lemon

#### c.xls或xlsx格式

In [12]:
df_excel = pd.read_excel('joyful-pandas-master/data/table.xlsx')
df_excel.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

#### 2. 写入
#### a.csv格式

In [13]:
df.to_csv('joyful-pandas-master/data/new_table.csv')

#### b.xls或xlsx格式

In [14]:
df.to_excel('joyful-pandas-master/data/new_table2.xlsx', sheet_name='Sheet1')

## 二、基本数据结构
#### 1.Series
#### a.创建一个Series
- Series序列，是一种一维的结构，类似于一维列表和ndarray中的一维数组，但是功能比他们要更为强大，Series由两部分组成：索引index和数值values.
- 语法：创建Series的语法：pd.Series()
- 常用参数：index，用于指定新的索引；dtype，用于指定元素的数据类型；
- 对于一个Series，其中最常用的属性为值（values），索引（index），名字（name），类型（dtype）

In [15]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name='这是一个Series',dtype='float64')
s

a   -0.034008
b   -1.464700
c    0.294011
d    0.275882
e   -0.314182
Name: 这是一个Series, dtype: float64

#### b.访问Series属性

In [16]:
s.values

array([-0.03400833, -1.46469989,  0.29401086,  0.27588229, -0.31418156])

In [17]:
s.name

'这是一个Series'

In [18]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [19]:
s.dtype

dtype('float64')

#### c.取出某一个元素

In [20]:
s['b']

-1.4646998888859646

#### d.调用方法

In [35]:
s.mean()

-0.24859932689607334

#### 2.DataFrame
#### a.创建一个DataFrame

In [22]:
df = pd.DataFrame({'col1':list('abcde'),'col2':range(5,10),'col3':[1.3,2.5,3.6,4.6,5.8]},
                 index=list('一二三四五'))
df

  col1  col2  col3
一    a     5   1.3
二    b     6   2.5
三    c     7   3.6
四    d     8   4.6
五    e     9   5.8

#### b.从DataFrame取出一列为Series

In [23]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [24]:
type(df)    #标记

pandas.core.frame.DataFrame

In [25]:
type(df['col1'])

pandas.core.series.Series

#### c.修改行或列名

In [26]:
df.rename(index={'一':'one'},columns={'col1':'new_col1'})  #修改行和列明

    new_col1  col2  col3
one        a     5   1.3
二          b     6   2.5
三          c     7   3.6
四          d     8   4.6
五          e     9   5.8

#### d.调用属性和方法

In [27]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [28]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [29]:
df.values

array([['a', 5, 1.3],
       ['b', 6, 2.5],
       ['c', 7, 3.6],
       ['d', 8, 4.6],
       ['e', 9, 5.8]], dtype=object)

In [30]:
df.shape

(5, 3)

In [31]:
df.mean()

col2    7.00
col3    3.56
dtype: float64

#### e.索引对齐特性

In [32]:
df1 = pd.DataFrame({'A':[1,2,3]},index=[1,2,3])
df2 = pd.DataFrame({'A':[1,2,3]},index=[3,1,2])
df1-df2 #标记，标记

   A
1 -1
2 -1
3  2

#### f.列的删除与添加
- 列的删除常用的方法是drop函数或del或pop （了解三者的差异）

In [33]:
df.drop(index='五',columns='col1')

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6

In [37]:
df['col1']=[1,2,3,4,5]
del df['col1']
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [38]:
df['col1']=[1,2,3,4,5]
df.pop('col1')

一    1
二    2
三    3
四    4
五    5
Name: col1, dtype: int64

In [39]:
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

- 列的增加：直接增加新的列，或者使用assign方法，assign方法不会对原DataFrame做修改

In [41]:
df1['B']=list('abc')
df1

   A  B
1  1  a
2  2  b
3  3  c

In [42]:
df1.assign(C=pd.Series(list('def')))

   A  B    C
1  1  a    e
2  2  b    f
3  3  c  NaN

#### g.根据类型选择列

In [43]:
df.select_dtypes(include=['number']).head()

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [44]:
df.select_dtypes(include=['float']).head()

   col3
一   1.3
二   2.5
三   3.6
四   4.6
五   5.8

#### h.将Series转换为DataFrame

In [45]:
s = df.mean()
s.name='to_DataFrame'        #标记，标记
s

col2    7.00
col3    3.56
Name: to_DataFrame, dtype: float64

In [46]:
s.to_frame()

      to_DataFrame
col2          7.00
col3          3.56

#### I.使用T符号可以转置

In [47]:
s.to_frame().T       #标记，标记

              col2  col3
to_DataFrame   7.0  3.56

## 三、常用基本函数
- 需要用到的虚拟数据集

In [48]:
df = pd.read_csv('joyful-pandas-master/data/table.csv')

#### 1. head和tail

In [49]:
df.head()    #标记，标记

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [50]:
df.tail()

   School Class    ID Gender   Address  Height  Weight  Math Physics
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

- 指定n参数显示多少行

In [51]:
df.head(3)

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+

#### 2. unique和nunique
- nunique显示有多少个唯一值

In [52]:
df['Physics'].nunique()   #有多少个唯一值

7

- unique显示所有的唯一值

In [54]:
df['Physics'].unique()   #唯一值

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

#### 3. count和value_counts
- count返回非缺失值元素个数

In [55]:
df['Physics'].count()  #仅非缺失值

35

- value_counts返回每个元素有多少个

In [57]:
df['Physics'].value_counts()     #包含缺失值

B+    9
B     8
B-    6
A     4
A-    3
A+    3
C     2
Name: Physics, dtype: int64

#### 4. describe和info
- info函数返回有哪些列、有多少非缺失值、每列的类型

In [58]:
df.info()   #标记，标记

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   35 non-null     object
 1   Class    35 non-null     object
 2   ID       35 non-null     int64
 3   Gender   35 non-null     object
 4   Address  35 non-null     object
 5   Height   35 non-null     int64
 6   Weight   35 non-null     int64
 7   Math     35 non-null     float64
 8   Physics  35 non-null     object
dtypes: float64(1), int64(3), object(5)
memory usage: 2.6+ KB

- describe默认统计数值型数据的各个统计量

In [60]:
df.describe()

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
max    2405.00000  195.000000  100.000000  97.000000

- 选择分位数

In [61]:
df.describe(percentiles=[.06, .26, .76, .96])

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
6%     1103.04000  157.040000   57.120000  32.744000
26%    1204.84000  161.000000   63.000000  47.536000
50%    2103.00000  173.000000   74.000000  61.700000
76%    2301.84000  187.840000   82.000000  79.344000
96%    2403.64000  193.640000   98.280000  92.692000
max    2405.00000  195.000000  100.000000  97.000000

- 非数值型也可以用describe函数

In [62]:
df['Physics'].describe()

count     35
unique     7
top       B+
freq       9
Name: Physics, dtype: object

#### 5. idxmax和nlargest
- idxmax函数返回最大值，在某些情况下特别适用，idxmin功能类似

In [63]:
df['Math'].idxmax() #最大值

5

- nlargest函数返回前几个大的元素值，nsmallest功能类似

In [64]:
df['Math'].nlargest(3)    #标记

5     97.0
28    95.5
11    87.7
Name: Math, dtype: float64

#### 6. clip和replace  
- clip和replace是两类替换函数
- clip是对超过或者低于某些值的数进行截断,replace是对某些值进行替换

In [65]:
df['Math'].head()

0    34.0
1    32.5
2    87.2
3    80.4
4    84.8
Name: Math, dtype: float64

In [66]:
df['Math'].clip(33,80).head()   #截断

0    34.0
1    33.0
2    80.0
3    80.0
4    80.0
Name: Math, dtype: float64

In [67]:
df['Math'].mad()   #标记标记

16.924244897959188

In [68]:
df['Address'].head()

0    street_1
1    street_2
2    street_2
3    street_2
4    street_4
Name: Address, dtype: object

In [69]:
df['Address'].replace(['street_1','street_2'],['one','two']).head()  #替换

0         one
1         two
2         two
3         two
4    street_4
Name: Address, dtype: object

- 通过字典，可以直接在表中修改

In [70]:
df.replace({'Address':{'street_1':'one','street_2':'two'}}).head()   #表中修改

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M       one     173      63  34.0      A+
1    S_1   C_1  1102      F       two     192      73  32.5      B+
2    S_1   C_1  1103      M       two     186      82  87.2      B+
3    S_1   C_1  1104      F       two     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

#### 7. apply函数
- 对于Series，它可以迭代每一列的值操作：(了解Apply 函数）

In [71]:
df['Math'].apply(lambda x:str(x)+'!').head()  #标记，标记

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

- 对于DataFrame，它可以迭代每一个列操作：

In [72]:
df.apply(lambda x:x.apply(lambda x:str(x)+'!')).head()   #标记，标记

  School Class     ID Gender    Address Height Weight   Math Physics
0   S_1!  C_1!  1101!     M!  street_1!   173!    63!  34.0!     A+!
1   S_1!  C_1!  1102!     F!  street_2!   192!    73!  32.5!     B+!
2   S_1!  C_1!  1103!     M!  street_2!   186!    82!  87.2!     B+!
3   S_1!  C_1!  1104!     F!  street_2!   167!    81!  80.4!     B-!
4   S_1!  C_1!  1105!     F!  street_4!   159!    64!  84.8!     B+!

## 四、排序
#### 1.索引排序

In [74]:
df.set_index('Math').head()   # 深入学习set_index函数

     School Class    ID Gender   Address  Height  Weight Physics
Math
34.0    S_1   C_1  1101      M  street_1     173      63      A+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
87.2    S_1   C_1  1103      M  street_2     186      82      B+
80.4    S_1   C_1  1104      F  street_2     167      81      B-
84.8    S_1   C_1  1105      F  street_4     159      64      B+

In [75]:
df.set_index('Math').sort_index().head()  #默认升序

     School Class    ID Gender   Address  Height  Weight Physics
Math
31.5    S_1   C_3  1301      M  street_4     161      68      B+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
32.7    S_2   C_3  2302      M  street_5     171      88       A
33.8    S_1   C_2  1204      F  street_5     162      63       B
34.0    S_1   C_1  1101      M  street_1     173      63      A+

#### 2.值排序

In [76]:
df.sort_values(by='Class').head()     #sort_values 函数

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
15    S_2   C_1  2101      M  street_7     174      84  83.3       C

- 多个值排序，即先对第一层排，在第一层相同的情况下对第二层排序

In [77]:
df.sort_values(by=['Address','Height']).head()     #两层排序

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
11    S_1   C_3  1302      F  street_1     175      57  87.7      A-
23    S_2   C_2  2204      M  street_1     175      74  47.2      B-
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
3     S_1   C_1  1104      F  street_2     167      81  80.4      B-

## 五、问题与练习
#### 1.问题

【问题一】 Series和DataFrame有哪些常见属性和方法？

1) Series常用属性
*  属性:            说明 
* values:         获取数组 
* index:          获取索引 
* name:           values的name 
* index.name:     索引的name 

2)DataFrame常用属性
*     属性:                                说明
* columns属性:          columns属性可以获得dataframe有哪些列，即dataframe的index
* shape属性:            shape属性是描述dataframe的形状的
* size属性:             dataframe的size属性返回的是dataframe的value的个数
* values属性:           values属性是返回当前dataframe的数据和index、columns相对应
* dtypes属性:           dtypes属性是描述当前dataframe的里的每列值的数据类型
* ndim属性:             dataframe的ndim属性和numpy的ndim意思一样
* T属性:                dataframe的T属性，实际是转置的意思

【问题二】 value_counts会统计缺失值吗？

- value_counts 不会统计缺失值

【问题三】 与idxmax和nlargest功能相反的是哪两组函数？

* 与idxmax功能相反的函数是idxmin
* 与nlargest功能相反的函数是nsmallest

【问题四】 在常用函数一节中，由于一些函数的功能比较简单，因此没有列入，现在将它们列在下面，请分别说明它们的用途并尝试使用

- Sum 求和函数
- Mean 求平均值函数
- median 求中值函数
- mad 求平均绝对偏差函数
- min 求最小值函数
- max 求最大值函数
- abs 求绝对值函数
- std 求标准差函数
- var 求方差函数
- quantile 求分位数函数
- cumsum 累计求和函数
- umprod 累乘函数

【问题五】 df.mean(axis=1)是什么意思？它与df.mean()的结果一样吗？第一问提到的函数也有axis参数吗？怎么使用？

- 语法 :mean(matrix,axis=0) （matrix为一个矩阵，axis为参数）
- 以m X n矩阵举例,axis 不设置值，对 mXn 个数求均值，返回一个实数，axis = 0：压缩行，对各列求均值，返回 1Xn 矩阵，axis =1 ：压缩列，对各行求均值，返回 m X1 矩阵   
- 结果不一样

#### 2.练习

【练习一】 现有一份关于美剧《权力的游戏》剧本的数据集，请解决以下问题：

- a.在所有的数据中，一共出现了多少人物？

In [88]:
df=pd.read_csv('joyful-pandas-master/data/Game_of_Thrones_Script.csv')
pd.read_csv('joyful-pandas-master/data/Game_of_Thrones_Script.csv').head()

,Release Date,Season,Episode,Episode Title,Name,Sentence
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.

In [89]:
df['Name'].nunique()

564

- b.以单元格计数（即简单把一个单元格视作一句），谁说了最多的话？

In [91]:
df['Name'].value_counts().nlargest(1)

tyrion lannister    1760
Name: Name, dtype: int64

- c.以单词计数，谁说了最多的单词？

In [92]:
df_words=df.assign(Words=df['Sentence'].apply(lambda x:len(x.split())))
df_words.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence,Words
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...,25
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...,21
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?,5
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.,5
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.,7

In [93]:
df_words.groupby('Name')['Words'].sum().sort_values().tail(1)

Name
tyrion lannister    26009
Name: Words, dtype: int64

【练习二】现有一份关于科比的投篮数据集，请解决如下问题：

- a.哪种action_type和combined_shot_type的组合是最多的？

In [95]:
pd.read_csv('joyful-pandas-master/data/Kobe_data.csv',index_col='shot_id').head()

,action_type,combined_shot_type,game_event_id,game_id,lat,loc_x,loc_y,lon,minutes_remaining,period,...,shot_made_flag,shot_type,shot_zone_area,shot_zone_basic,shot_zone_range,team_id,team_name,game_date,matchup,opponent
shot_id,,,,,,,,,,,,,,,,,,,,,
1,Jump Shot,Jump Shot,10,20000012,33.9723,167,72,-118.1028,10,1,...,NaN,2PT Field Goal,Right Side(R),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
2,Jump Shot,Jump Shot,12,20000012,34.0443,-157,0,-118.4268,10,1,...,0.0,2PT Field Goal,Left Side(L),Mid-Range,8-16 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
3,Jump Shot,Jump Shot,35,20000012,33.9093,-101,135,-118.3708,7,1,...,1.0,2PT Field Goal,Left Side Center(LC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
4,Jump Shot,Jump Shot,43,20000012,33.8693,138,175,-118.1318,6,1,...,0.0,2PT Field Goal,Right Side Center(RC),Mid-Range,16-24 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR
5,Driving Dunk Shot,Dunk,155,20000012,34.0443,0,0,-118.2698,6,2,...,1.0,2PT Field Goal,Center(C),Restricted Area,Less Than 8 ft.,1610612747,Los Angeles Lakers,2000/10/31,LAL @ POR,POR

In [97]:
df=pd.read_csv('joyful-pandas-master/data/Kobe_data.csv',index_col='shot_id')
pd.Series(list(zip(df['action_type'],df['combined_shot_type']))).value_counts().index[0]

('Jump Shot', 'Jump Shot')

- b.在所有被记录的game_id中，遭遇到最多的opponent是一个支？

#### 我不会，看答案也没看懂，今天来不及了，后面等我学完再回头做下。标记标记标记